# SubfaceArisesFromElementFace Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementBoundarySubface..::..SubfaceArisesFromElementFace Property
SpatialElementBoundarySubface Class See Also
---
Indicates if the subface is coincident with a portion of a (possibly offset) face of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool SubfaceArisesFromElementFace { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SubfaceArisesFromElementFace As Boolean
	Get
```

Visual C++
---
```text
public:
property bool SubfaceArisesFromElementFace {
	bool get ();
}
```

# See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace